<template lang="pug">
  div
    index(
      :indexes='indexes'
    )
    .lp
      .lp-inner
        h2(
          id="Summary"
        )
          |Summary
          span
        p
          |timelineメソッドは、個々のアニメーションを繋げて実行することができるメソッドです。例えるなら、パワーポイントのアニメーション。1つ目のアニメーションが終了すれば、次のアニメーションに移る事もできるし、前回のアニメーションと同時に実行する事もできます。
        p
          |.pause(), .timeScale() のようなTweenメソッドを併用すれば、途中で止める事も一定間隔だけ倍速で再生する事もできて、アニメーションをグループ化して自由自在に操ることのできる便利ツール、それがtimelineメソッド。
        p
          |timelineメソッドは、個々のアニメーションを繋げて実行することができるメソッドです。例えるなら、パワーポイントのアニメーション。1つ目のアニメーションが終了すれば、次のアニメーションに移る事もできるし、前回のアニメーションと同時に実行する事もできます。
        p
          |.pause(), .timeScale() のようなTweenメソッドを併用すれば、途中で止める事も一定間隔だけ倍速で再生する事もできて、アニメーションをグループ化して自由自在に操ることのできる便利ツール、それがtimelineメソッド。
        p
          |timelineメソッドは、個々のアニメーションを繋げて実行することができるメソッドです。例えるなら、パワーポイントのアニメーション。1つ目のアニメーションが終了すれば、次のアニメーションに移る事もできるし、前回のアニメーションと同時に実行する事もできます。
        p
          |.pause(), .timeScale() のようなTweenメソッドを併用すれば、途中で止める事も一定間隔だけ倍速で再生する事もできて、アニメーションをグループ化して自由自在に操ることのできる便利ツール、それがtimelineメソッド。
        p
          |timelineメソッドは、個々のアニメーションを繋げて実行することができるメソッドです。例えるなら、パワーポイントのアニメーション。1つ目のアニメーションが終了すれば、次のアニメーションに移る事もできるし、前回のアニメーションと同時に実行する事もできます。
        p
          |.pause(), .timeScale() のようなTweenメソッドを併用すれば、途中で止める事も一定間隔だけ倍速で再生する事もできて、アニメーションをグループ化して自由自在に操ることのできる便利ツール、それがtimelineメソッド。
        p
          |timelineメソッドは、個々のアニメーションを繋げて実行することができるメソッドです。例えるなら、パワーポイントのアニメーション。1つ目のアニメーションが終了すれば、次のアニメーションに移る事もできるし、前回のアニメーションと同時に実行する事もできます。
        p
          |.pause(), .timeScale() のようなTweenメソッドを併用すれば、途中で止める事も一定間隔だけ倍速で再生する事もできて、アニメーションをグループ化して自由自在に操ることのできる便利ツール、それがtimelineメソッド。
        p
          |timelineメソッドは、個々のアニメーションを繋げて実行することができるメソッドです。例えるなら、パワーポイントのアニメーション。1つ目のアニメーションが終了すれば、次のアニメーションに移る事もできるし、前回のアニメーションと同時に実行する事もできます。
        p
          |.pause(), .timeScale() のようなTweenメソッドを併用すれば、途中で止める事も一定間隔だけ倍速で再生する事もできて、アニメーションをグループ化して自由自在に操ることのできる便利ツール、それがtimelineメソッド。
</template>

<script>
import Index from "~/components/ui/Index";

export default {
  components: {
    Index
  },
  data() {
    return {
      indexes: [
        {
          index2: "Summary",
        },
        {
          index2: "Basic",
          contents: ["gsap.to()", "gsap.from()", "gsap.fromTo()"]
        }
      ]
    }
  }
}

</script>

<style lang="scss" scoped>

</style>
